***DATA WRANGLING***

In [11]:
import pandas as pd
url="/content/datasets_11657_16098_train.csv"
dataframe=pd.read_csv(url)
dataframe.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

CREATING A DATA FRAME

Q1.You want to create a new data frame

In [12]:
import pandas as pd
data=pd.DataFrame()
data['Name']=['Megha','Mukesh','Rakesh']
data['Age']=[12,14,25]
data['Sex']=['F','M','M']
data

     Name  Age Sex
0   Megha   12   F
1  Mukesh   14   M
2  Rakesh   25   M

append new rows to the bottom

In [13]:
new_person=pd.Series(['Mayank',34,'M'],index=['Name','Age','Sex'])
data.append(new_person,ignore_index=True)

     Name  Age Sex
0   Megha   12   F
1  Mukesh   14   M
2  Rakesh   25   M
3  Mayank   34   M

Characteristics of Data

In [14]:
data.shape

(3, 3)

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Sex     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [16]:
data.describe()

        Age
count   3.0
mean   17.0
std     7.0
min    12.0
25%    13.0
50%    14.0
75%    19.5
max    25.0

In [17]:
data.tail
# tail=last few rows
#head=first few rows

<bound method NDFrame.tail of      Name  Age Sex
0   Megha   12   F
1  Mukesh   14   M
2  Rakesh   25   M>

Q2.You need to select individual data or slices of a DataFrame.

In [18]:
dataframe.iloc[0]
# data=titanic
# iloc gives one or more rows or values

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

loc is useful when the index of the DataFrame is a label (e.g., a string). 

iloc works by looking for the position in the DataFrame. For example, iloc[0] will return the first row regardless of whether the index is an integer or a label

In [19]:
dataframe.iloc[1:3]

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S

[2 rows x 12 columns]

In [20]:
dataframe=dataframe.set_index(dataframe['Cabin'])
dataframe.loc['C85']

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                           38
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: C85, dtype: object

Q3.You want to select DataFrame rows based on some condition

In [21]:
dataframe[dataframe['Sex']=='female'].head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
C85              2         1       1  ...  71.2833   C85         C
NaN              3         1       3  ...   7.9250   NaN         S

[2 rows x 12 columns]

In [22]:
dataframe[(dataframe['Sex']=='female')&(dataframe['Age']>=65)]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

Q4.You need to replace values in a DataFrame.

In [23]:
dataframe['Sex'].replace("female","woman").head(2)

Cabin
NaN     male
C85    woman
Name: Sex, dtype: object

In [24]:
dataframe.replace(r"1st", "First", regex=True).head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
NaN              1         0       3  ...   7.2500   NaN         S
C85              2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

RENAMING COLUMNS

In [25]:
dataframe.rename(columns={'Pclass':'Passenger Class'}).head(2)

       PassengerId  Survived  Passenger Class  ...     Fare Cabin  Embarked
Cabin                                          ...
NaN              1         0                3  ...   7.2500   NaN         S
C85              2         1                1  ...  71.2833   C85         C

[2 rows x 12 columns]

Q5.You want to find the min, max, sum, average, or count of a numeric column.

In [26]:
print(dataframe['Age'].max())

80.0

In [27]:
print(dataframe['Age'].min())

0.42

In [28]:
dataframe.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

Q6.You want to select all unique values in a column.

In [29]:
dataframe['Sex'].unique()

array(['male', 'female'], dtype=object)

In [30]:
dataframe['Sex'].nunique()

2

In [31]:
dataframe['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

Q7.You want to select missing values in a DataFram

In [32]:
dataframe[dataframe['Age'].isnull()].head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
NaN              6         0       3  ...   8.4583   NaN         Q
NaN             18         1       2  ...  13.0000   NaN         S

[2 rows x 12 columns]

In [33]:
import numpy as np
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)

Q8.You want to delete a column from your DataFrame.

In [34]:
dataframe.drop('Age',axis=1).head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
NaN              1         0       3  ...   7.2500   NaN         S
C85              2         1       1  ...  71.2833   C85         C

[2 rows x 11 columns]

In [35]:
dataframe.drop(['Age','Sex'],axis=1).head(2)

       PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
Cabin                                 ...
NaN              1         0       3  ...   7.2500    NaN         S
C85              2         1       1  ...  71.2833    C85         C

[2 rows x 10 columns]

Q9.You want to delete one or more rows from a DataFrame.

In [36]:
dataframe[dataframe['Sex']!='male'].head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
NaN              1         0       3  ...   7.2500   NaN         S
C85              2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [37]:
dataframe[dataframe['Name']!='Braund, Mr. Owen Harris'].head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
C85              2         1       1  ...  71.2833   C85         C
NaN              3         1       3  ...   7.9250   NaN         S

[2 rows x 12 columns]

In [40]:
dataframe[dataframe.index!=0].head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
NaN              1         0       3  ...   7.2500   NaN         S
C85              2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [42]:
dataframe[dataframe['PassengerId']!=1].head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
C85              2         1       1  ...  71.2833   C85         C
NaN              3         1       3  ...   7.9250   NaN         S

[2 rows x 12 columns]

Q10.You want to drop duplicate rows from your DataFrame.

In [43]:
len(dataframe)

891

In [44]:
dataframe.drop_duplicates().head(2)

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
NaN              1         0       3  ...   7.2500   NaN         S
C85              2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [47]:
len(dataframe.drop_duplicates())

891

The reason is because drop_duplicates defaults to only dropping rows that match perfectly across all columns. Under this condition, every row in our DataFrame, data frame, is actually unique. However, often we want to consider only a subset of columns to check for duplicate rows. We can accomplish this using the subset parameter:

In [48]:
dataframe.drop_duplicates(subset=['Sex'])

       PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
Cabin                                 ...
NaN              1         0       3  ...   7.2500   NaN         S
C85              2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

Q11.You want to group individual rows according to some shared value.

In [49]:
dataframe.groupby('Sex').mean()

        PassengerId  Survived    Pclass  ...     SibSp     Parch       Fare
Sex                                      ...
female   431.028662  0.742038  2.159236  ...  0.694268  0.649682  44.479818

[1 rows x 7 columns]

In [50]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    549
1    342
Name: Name, dtype: int64

In [51]:
dataframe.groupby('Survived')['Age'].count()

Survived
0    424
1    290
Name: Age, dtype: int64

Q11.You need to group individual rows by time periods

In [54]:
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
dataframe=pd.DataFrame(index=time_index)
dataframe['Sale_Amount']=np.random.randint(1,10,100000)
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86768
2017-06-18       100928
2017-06-25       100735
2017-07-02       100888
2017-07-09       101040
2017-07-16        10267